---
kind: type
id: T:Autodesk.Revit.DB.Plumbing.PipeSystemType
source: html/24165d09-9267-54b7-3e32-6405d1343c2e.htm
---
# Autodesk.Revit.DB.Plumbing.PipeSystemType

An enumerated type listing all the possible pipe system types for a connector object.

## Syntax (C#)
```csharp
public enum PipeSystemType
```